Repository: nquangminhBK/CupidMentor
Catalog: lib/l10n/app_*.arb
Languages: ja, vi

# profileProwessDescription
source: Create a captivating bio to attract matches. Let us guide you in showcasing your personality for better matches.
ja: 魅力的な自己紹介文を作成して、マッチングを引き寄せましょう。私たちがあなたの個性を引き出す方法をご案内します。
vi: Tạo một hồ sơ hấp dẫn để thu hút người phù hợp. Hãy để chúng tôi hướng dẫn bạn cách thể hiện tính cách của bạn để có được những mối kết nối tốt hơn.

# selfEnhancementDescription
source: Elevate your dating journey with personalized tips. From self-care to communication, empower yourself for success in dating.
ja: パーソナライズされたアドバイスであなたのデートの旅を高めましょう。セルフケアからコミュニケーションまで、デートで成功するために自分自身を強化しましょう。
vi: Nâng cao hành trình hẹn hò của bạn với những lời khuyên cá nhân hóa. Từ chăm sóc bản thân đến giao tiếp, hãy làm chủ bản thân để thành công trong hành trình hẹn hò.

# datingDelightDescription
source: Explore ideal gifts, date spots, and messaging tips for memorable interactions. Let our expert suggestions enhance your joyful dating experience.
ja: 思い出に残るインタラクションのための理想的なギフト、デートスポット、メッセージングのヒントを探求しましょう。専門家の提案で、あなたの楽しいデート体験をさらに豊かにしましょう。
vi: Khám phá những món quà lý tưởng, những địa điểm hẹn hò và những lời khuyên về tin nhắn để tạo ra những trải nghiệm đáng nhớ. Hãy để những đề xuất của chúng tôi làm tăng thêm niềm vui trong hành trình hẹn hò của bạn.

# loginAnimationText
source: Logging in...
ja: ログイン中...
vi: Đăng nhập...

# loadingAnimationText
source: Loading...
ja: 読み込み中...
vi: Đang load...

# loginButtonText
source: Continue with Google
ja: Googleで続行する
vi: Tiếp tục với google

# toStartJourney
source: To start your journey, let's
ja: あなたの旅を始めましょう
vi: Để bắt đầu, hãy

# inputBasicInfoTitle
source: We're thrilled to have you here. What should we call you? 👋
ja: ここにいて嬉しいです。何とお呼びすればよろしいですか？ 👋
vi: Chúng tôi rất vui khi có bạn ở đây. Chúng tôi nên gọi bạn là gì? 👋

# inputBasicInfoDesc
source: The more detailed your answers, the better Cupid Mentor can give personalized suggestions for you. Let's dive in!!!
ja: より詳細な回答をすると、Cupid Mentorがよりパーソナライズされた提案をすることができます。さあ、始めましょう!!!
vi: Càng chi tiết câu trả lời của bạn, Cupid Mentor có thể đưa ra những gợi ý cá nhân hóa tốt hơn cho bạn. Hãy bắt đầu thôi!!!

# nameFieldTitle
source: Your name is
ja: あなたの名前は？
vi: Tên bạn là

# nameFieldHint
source: Enter your name
ja: あなたの名前を入力してください
vi: Nhập tên

# genderFieldTitle
source: Your gender is
ja: あなたの性別は?
vi: Giới tính của bạn là

# genderFieldHint
source: Choose your gender
ja: 性別を選択してください
vi: Chọn giới tính

# birthdayFieldTitle
source: Your birthday is
ja: あなたの誕生日は？
vi: Ngày sinh của bạn là

# birthdayFieldHint
source: Select your birthday
ja: 誕生日を選択してください
vi: Chọn ngày

# jobFieldTitle
source: And your job is
ja: あなたの職業は？
vi: Và công việc hiện tại của bạn là

# jobFieldHint
source: Enter your job
ja: 職業を入力してください
vi: Nhập công việc của bạn

# informationSafe
source: Your information will be safe with us.
ja: お客様の情報は安全です.
vi: Thông tin của bạn sẽ được bảo mật với chúng tôi.

# inputPartnerBasicInfoTitle
source: Got it, and now is some questions about your crush 💘
vi: Đã hiểu, và bây giờ là một số câu hỏi về người bạn thích 💘

# inputPartnerBasicInfoDesc
source: You can skip any information you're unsure of and update it later. Your journey, your pace!
vi: Bạn có thể bỏ qua bất kỳ thông tin nào mà bạn không chắc chắn và cập nhật sau. Hành trình của bạn, tốc độ của bạn!

# femalePartnerNameFieldTitle
source: Her name is
vi: Tên cô ấy là

# malePartnerNameFieldTitle
source: His name is
vi: Tên anh ấy là

# partnerNameFieldTitle
source: Her/his name is
vi: Tên cô ấy/anh ấy là

# partnerNameFieldHint
source: Enter name
vi: Nhập tên

# femalePartnerGenderFieldTitle
source: Her gender is
vi: Giới tính của cô ấy là

# malePartnerGenderFieldTitle
source: His gender is
vi: Giới tính của anh ấy là

# partnerGenderFieldTitle
source: Her/his gender is
vi: Giới tính của cô ấy/anh ấy là

# partnerGenderFieldHint
source: Choose gender
vi: Chọn giới tính

# femalePartnerBirthdayFieldTitle
source: Her birthday is
vi: Sinh nhật của cô ấy là

# malePartnerBirthdayFieldTitle
source: His birthday is
vi: Sinh nhật của anh ấy là

# partnerBirthdayFieldTitle
source: Her/his birthday is
vi: Sinh nhật của cô ấy/anh ấy là

# partnerBirthdayFieldHint
source: Select birthday
vi: Chọn ngày sinh

# femalePartnerJobFieldTitle
source: Her job is
vi: Công việc của cô ấy là

# malePartnerJobFieldTitle
source: His job is
vi: Công việc của anh ấy là

# partnerJobFieldTitle
source: Her/his job is
vi: Công việc của cô ấy/anh ấy là

# partnerJobFieldHint
source: Enter job
vi: Nhập nghề nghiệp

# inputHobbiesTitle
source: We’re excited to discover your unique interests & passions 🤩
ja: あなたのユニークな趣味や情熱を発見するのが楽しみです 🤩
vi: Chúng tôi rất háo hức khám phá những sở thích và niềm đam mê đặc biệt của bạn 🤩

# inputHobbiesDesc
source: Feel free to share your hobbies so we can tailor our suggestions perfectly for you.
ja: あなたの趣味を共有してください。私たちはあなたにぴったりの提案をするために役立てます。
vi: Hãy chia sẻ những sở thích của bạn để chúng tôi có thể tùy chỉnh những gợi ý hoàn hảo cho bạn.

source: Search hobbies
ja: 趣味を検索
vi: Tìm kiếm sở thích

# inputMalePartnerHobbiesTitle
source: We’ve almost there. What are his hobbies? 🤘
vi: Chúng ta gần đến rồi. Sở thích của anh ấy là gì? 🤘

# inputFemalePartnerHobbiesTitle
source: We’ve almost there. What are her hobbies? 🤘
vi: Chúng ta gần đến rồi. Sở thích của cô ấy là gì? 🤘

# inputMalePartnerHobbiesDesc
source: We can craft date ideas and gift suggestions that truly resonate with his interests.
vi: Chúng tôi có thể đề xuất ý tưởng hẹn hò và quà tặng phù hợp với sở thích thực sự của anh ấy.

# inputFemalePartnerHobbiesDesc
source: We can craft date ideas and gift suggestions that truly resonate with her interests.
vi: Chúng tôi có thể đề xuất ý tưởng hẹn hò và quà tặng phù hợp với sở thích thực sự của cô ấy.

# inputLoveLanguageTitle
source: Tell us about your love languages 🫶🏻
ja: あなたの愛の言語について教えてください 🫶🏻
vi: Hãy cho chúng tôi biết về ngôn ngữ yêu thích của bạn 🫶🏻

# inputLoveLanguageDesc
source: Uncover your unique love languages and prioritize them. Let's rank your heart's desires for having more fulfilling connections in the future!
ja: あなたのユニークな愛の言語を発見し、それらを優先します。より充実したつながりを築くためにあなたの心の望みをランク付けしましょう！
vi: Khám phá ngôn ngữ yêu thích độc đáo của bạn và ưu tiên chúng. Hãy xếp hạng những mong muốn của trái tim để có những kết nối hài lòng hơn trong tương lai!

# loveLanguageExplain1
source: First, tap the items below to select, you can arrange the order after selecting,
ja: まず、以下のアイテムをタップして選択し、選択後に順序を整えることができます。
vi: Đầu tiên, chạm vào các mục dưới đây để chọn, bạn có thể sắp xếp thứ tự sau khi chọn,

# loveLanguageExplain2
source: click here
ja: ここをクリックして
vi: nhấn vào đây

# loveLanguageExplain3
source: to read more about the concept love language.
ja: 恋愛言語の概念について詳しく読む。
vi: để đọc thêm về khái niệm ngôn ngữ yêu thích.

# inputPersonalitiesTitle
source: Describe yourself in a few words that we can know the real you 🙄
ja: あなた自身を数語で説明してください。本当のあなたを知ることができます 🙄
vi: Miêu tả bản thân bằng vài từ để chúng tôi có thể hiểu bạn thật sự 🙄

# inputPersonalitiesDesc
source: Choose some words that best describe your personality. This enables us to enhance your unique and memorable dating experience.
ja: あなたの個性を最もよく表す言葉を選んでください。これにより、あなたのユニークで記憶に残るデート体験を向上させることができます。
vi: Chọn một số từ mô tả tốt nhất về tính cách của bạn. Điều này giúp chúng tôi nâng cao trải nghiệm hẹn hò độc đáo và đáng nhớ của bạn.

source: Search personalities
ja: 個性を検索
vi: Tìm kiếm tính cách

# inputRelationshipStatusTitle
source: Have you found your perfect match? 😘
ja: あなたはすでに完璧な相手を見つけましたか？ 😘
vi: Bạn đã tìm thấy mối quan hệ hoàn hảo của mình chưa? 😘

# inputRelationshipStatusDesc
source: Let us know if there's someone special in your life.
ja: あなたの人生に特別な人がいる場合は教えてください。
vi: Hãy cho chúng tôi biết nếu có ai đặc biệt trong cuộc đời bạn.

source: Not have yet
ja: まだありません
vi: Chưa có

source: Already have
ja: すでにいます
vi: Đã có

# inputRelationshipStatusDesc2
source: Wow that's wonderful! Congratulations! So what's your relationship with that special someone?
ja: すごい、おめでとうございます！では、その特別な人との関係はどうですか？
vi: Wow, tuyệt vời quá! Chúc mừng bạn! Vậy mối quan hệ của bạn với người đặc biệt đó là gì?

# inputPartnerHobbiesTitle
source: We’ve almost there. What are her/his hobbies? 🤘
vi: Chúng ta gần đến rồi. Sở thích của cô ấy/an ấy là gì? 🤘

# inputPartnerHobbiesDesc
source: We can craft date ideas and gift suggestions that truly resonate with her/his interests.
vi: Chúng tôi có thể đề xuất ý tưởng hẹn hò và quà tặng phù hợp với sở thích thực sự của cô ấy/an ấy.

source: Save
ja: 保存する
vi: Lưu

# continueBtn
source: Continue
ja: 続ける
vi: Tiếp tục

# languageSelected
source: You've just picked English, you can change the language after, in the Setting page
ja: 日本語を選択しましたが、後で設定ページで言語を変更できます。
vi: Bạn đã chọn Tiếng Việt, bạn có thể thay đổi ngôn ngữ sau, trong phần Cài Đặt.

source: Cancel
ja: キャンセル
vi: Hủy

source: Start
ja: 始める
vi: Bắt đầu

source: Skip
ja: スキップ
vi: Bỏ qua

# alrightStart
source: All right, let's get started!
ja: さあ、始めましょう!
vi: Được rồi, bắt đầu thôi

# welcomeScreenTitle
source: Welcome
ja: こんにちは
vi: Xin chào

# welcomeScreenDesc
source: Get ready to explore the valuable tips and advice we bring for you.
ja: 私たちがお届けする貴重なヒントやアドバイスを探求する準備をしてください。
vi: Sẵn sàng khám phá những tips, những lời khuyên đầy thú vị và bổ ích mà chúng tôi mang đến cho bạn.

# letStartButton
source: Okay, let's start
ja: はい、始めましょう
vi: Bắt đầu thôi

source: Your info 😊
ja: あなたの情報 😊
vi: Thông tin của bạn 😊

# partnerInfo
source: Partner's Info 💜
ja: パートナーの情報 💜
vi: Thông tin đối phương 💜

# tipsReplyDesc
source: Struggling to craft the perfect responses? Don’t worry, we’re here for you!!!
ja: 完璧にメッセージに返信する方法がわからない場合でも心配しないで、私たちがお手伝いします！！！
vi: Bạn không biết trả lời tin nhắn như thế nào cho hoàn hảo, đừng lo, chúng tôi sẽ giúp bạn!!!

# tipsReplyButtonTitle
source: Let's try
ja: やってみましょう
vi: Thử ngay

# tipSelfImprovementTitle
source: Some Tips For You
ja: あなたへのいくつかのヒント
vi: Một số Mẹo Cho Bạn

# tipSelfImprovementDesc
source: Covering self-improvement, crafting an engaging bio, body language, etc.
ja: 自己改善、魅力的なバイオを作成する方法、ボディランゲージなどをカバー。
vi: Bao gồm tự cải thiện bản thân, tạo bio hấp dẫn, ngôn ngữ cơ thể, v.v.

# tipSelfImprovementButton
source: Explore Tips
ja: ヒントを探索する
vi: Khám phá Mẹo

# tipGiftTitle
source: The Ideal Gifts
ja: 理想的なギフト
vi: Món Quà Lí Tưởng

# tipGiftDesc
source: Offering suitable gifts for special occasions like Christmas, Birthdays, etc.
ja: クリスマスや誕生日などの特別な場合に適したギフトを提供。
vi: Đề xuất các món quà phù hợp cho các dịp đặc biệt như Giáng Sinh, Sinh Nhật, v.v.

# tipGiftButton
source: See All Gifts
ja: すべてのギフトを見る
vi: Xem gợi ý

# tipDateSpotTitle
source: The Perfect Date Spots
ja: パーフェクトなデートスポット
vi: Địa Điểm Hẹn Hò Lý Tưởng

# tipDateSpotDesc
source: Suggesting interesting date spots based on your and partner's preferences.
ja: あなたとパートナーの好みに基づいて興味深いデートスポットを提案。
vi: Đề xuất những địa điểm hẹn hò thú vị dựa trên sở thích của bạn và đối tác.

# tipDateSpotButton
source: View All Spots
ja: すべてのスポットを見る
vi: Khám phá

# tipsReplyingTitle
source: Messages replying tips 💬
ja: メッセージ返信ガイド 💬
vi: Tip nhắn tin 💬

source: Setting
ja: 設定
vi: Cài đặt

source: Theme
ja: テーマ
vi: Giao diện

source: Light
ja: ライト
vi: Sáng

source: Dark
ja: ダーク
vi: Tối

source: Language
ja: 言語
vi: Ngôn ngữ

source: Choose language
ja: 言語を選択
vi: Chọn ngôn ngữ

source: Change
ja: 変更
vi: Thay đổi

source: Help center
ja: ヘルプセンター
vi: Trung tâm trợ giúp

source: About the author
ja: 著者について
vi: Về tác giả

source: Logout
ja: ログアウト
vi: Đăng xuất

# generateFailed
source: Too many requests, please try again in a few minutes.
ja: リクエストが多すぎます。数分後にもう一度お試しください。
vi: Quá nhiều yêu cầu, vui lòng thử lại sau ít phút.

# generateANewOne
source: Let's generate a new one
ja: 新しいものを生成してください
vi: Đưa ra một gợi ý mới

source: Generating...
ja: 生成中...
vi: Đang tạo...

# addPartnerScreenTitle
source: What's your relationship with that special someone?
ja: その特別な人との関係はどうですか？
vi: Mối quan hệ của bạn với người đặc biệt đó là gì?

# addPartnerDesc
source: If you have someone special in your life, please share some details about them so we can provide you with more tailored and meaningful advice.
ja: もし特別な人がいるなら、その人について少し教えてください。もっと具体的で有益なアドバイスができるようになります。
vi: Nếu bạn đã có người đặc biệt của mình, hãy cho chúng tôi biết một vài thông tin về người đó để chúng tôi có thể cho bạn nhiều lời khuyên hợp lý và cụ thể hơn nhé!

# addPartnerInfoBtn
source: Add information
ja: その人の情報を入力
vi: Nhập thông tin

# onboardingMissingNameError
source: Please input your name!
ja: 名前を入力してください！
vi: Vui lòng nhập tên của bạn!

# onboardingMissingGenderError
source: Please select your gender!
ja: 性別を選択してください！
vi: Vui lòng chọn giới tính của bạn!

# onboardingMissingBirthdayError
source: Please input your birthday!
ja: 誕生日を入力してください！
vi: Vui lòng nhập ngày sinh của bạn!

# onboardingMissingJobError
source: Please input your job!
ja: 仕事を入力してください！
vi: Vui lòng nhập công việc của bạn!

# onboardingMissingPersonalitiesError
source: Please select some work to describe the real you!
ja: あなたの本当の姿を表すいくつかの仕事を選択してください！
vi: Vui lòng chọn một số đặc điểm để miêu tả con người thật của bạn!

# onboardingMissingHobbiesError
source: Please select some hobbies, The more we know about you, the easier it will be for us to give advice!
ja: 趣味を選択してください。私たちがあなたについて知るほど、より良いアドバイスを提供できます！
vi: Vui lòng chọn một số sở thích của bạn, chúng tôi càng biết nhiều về bạn, chúng tôi sẽ dễ dàng đưa ra lời khuyên hơn!

# onboardingMissingLoveLanguagesError
source: Please tell us about your love language, The more we know about you, the easier it will be for us to give advice!
ja: あなたの愛の言語について教えてください。私たちがあなたについて知るほど、より良いアドバイスを提供できます！
vi: Vui lòng cho chúng tôi biết về ngôn ngữ tình yêu của bạn, chúng tôi càng biết nhiều về bạn, chúng tôi càng dễ dàng đưa ra lời khuyên hơn!

# onboardingMissingRelationshipTypeError
source: Please select your relationship with them before adding their personal information!
ja: 彼らの個人情報を追加する前に、あなたと彼らの関係を選択してください！
vi: Vui lòng chọn mối quan hệ của bạn với họ trước khi thêm thông tin cá nhân của họ!

# onboardingMissingPartnerGenderError
source: Please let us know at least their gender so we can offer more tailored advice.
ja: より良いアドバイスを提供できるように、彼らの性別を少なくとも教えてください。
vi: Vui lòng cho chúng tôi biết ít nhất là giới tính của họ để chúng tôi đưa ra những lời khuyên tốt hơn.

# loveLanguagesDialogTitle
source: What is the "Love Languages"
vi: "Ngôn ngữ tình yêu" là gì?

source: Basic info
vi: Thông tin

source: Job
vi: Nghề nghiệp

source: Describe you
vi: Tính cách

source: Hobbies
vi: Sở thích

source: Love languages
vi: Ngôn ngữ tình yêu

# relationshipStatus
source: Relationship
vi: Trạng thái

source: Edit
vi: Chỉnh sửa

source: No data
vi: Không có dữ liệu

# updateBasicInfoTitle
source: Update your information
vi: Cập nhật thông tin của bạn

# updatePersonalities
source: Update your personalities
vi: Cập nhật tính cách của bạn

# updateHobbies
source: Update your hobbies
vi: Cập nhật sở thích của bạn

# updateLoveLanguages
source: Update your love languages
vi: Cập nhật ngôn ngữ tình yêu của bạn

source: Relationship
vi: Mối quan hệ

# updatePartnerInfoTitle
source: Update partner's information
vi: Cập nhật thông tin đối phương

# updatePartnerHobbies
source: Update partner's hobbies
vi: Cập nhật sở thích đối phương

source: Update
vi: Cập nhật

# updateSuccess
source: Update successful
vi: Cập nhật thành công

# loginFailedMsg
source: Login failed, please try again later!
vi: Đăng nhập thất bại, vui lòng thử lại sau!

# saveInfoFailedMsg
source: Saving information failed, please try again!
vi: Lưu thông tin không thành công, vui lòng thử lại sau!

# getUserInfoFailedMsg
source: Get user information failed, please try again!
vi: Không thể lấy thông tin, vui lòng thử lại sau!

# deleteConversationDialogTitle
source: Are you sure you want to delete this conversation?
vi: Bạn có chắc chắn muốn xóa cuộc trò chuyện này không?

source: Delete
vi: Xóa

# deletePartnerInfoDialogTitle
source: Are you sure you want to delete the partner's information?
vi: Bạn có chắc chắn muốn xóa thông tin của đối phương không?

source: Delete account
vi: Xóa tài khoản

# deleteAccountDialogTitle
source: Are you sure you want to delete your account?
vi: Bạn có chắc chắn muốn xóa tài khoản của mình không?

# logoutDialogTitle
source: Are you sure you want to log out?
vi: Bạn có chắc chắn muốn đăng xuất không?

# tipReplyDialogInstructionTitle
source: Suggestions for how to respond to messages!
vi: Gợi ý cách phản hồi tin nhắn!

# tipReplyDialogInstructionDescription
source: This is one of our most exciting features. Just click the "Let's try" button, send us a message from your partner, and we'll analyze and offer you the most charming replies!
vi: Đây là một trong những tính năng thú vị nhất của chúng tôi. Chỉ cần nhấp vào nút "Thử ngay" và gửi cho chúng tôi tin nhắn từ đối phương, chúng tôi sẽ phân tích và cung cấp cho bạn những câu trả lời tuyệt nhất!

# tipSelfImprovementDialogInstructionTitle
source: Some Tips For You!
vi: Một số mẹo dành cho bạn!

# tipSelfImprovementDialogInstructionDescription
source: Click on "Explore tips," where you'll find valuable advice and suggestions to enhance your personal growth and strengthen your relationship with your partner.
vi: Nhấp vào "Khám phá Mẹo", nơi bạn sẽ tìm thấy những lời khuyên và gợi ý giá trị để phát triển cá nhân cũng như cách để xây dựng mối quan hệ vững chắc với đối phương.

# tipGiftDialogInstructionTitle
source: The Ideal Gifts
vi: Món quà lý tưởng

# tipGiftDialogInstructionDescription
source: Unsure about what gift to give your special someone? No worries! Just select "See All Gifts" button then choose the special occasion you want to celebrate, and we'll provide the perfect gift suggestions tailored for your partner. 😋
vi: Bạn chưa biết tặng quà gì cho người ấy? Đừng lo lắng! Chỉ cần chọn "Xem gợi ý" và sau đó chọn dịp đặc biệt mà bạn muốn tặng quà, chúng tôi sẽ cung cấp các gợi ý quà tặng hoàn hảo phù hợp với đối phương. 😋

# tipDateSpotDialogInstructionTitle
source: The Perfect Date Spots
vi: Địa điểm hẹn hò lý tưởng

# tipDateSpotDialogInstructionDescription
source: Looking for the perfect date spot with your loved one? Explore our fantastic suggestions by selecting "View All Spots," and then choose the special occasion you'd like to celebrate.
vi: Bạn đang tìm kiếm địa điểm hẹn hò lý tưởng với người ấy? Khám phá các gợi ý tuyệt vời của chúng tôi bằng cách chọn "Khám phá", sau đó chọn dịp đặc biệt bạn muốn kỷ niệm.

source: Feature introduction
vi: Giới thiệu tính năng

source: About us
vi: Về chúng tôi

# couldNotLoadData
source: Could not load data, please try again!
vi: Không thể tải dữ liệu, vui lòng thử lại!

# processSuccess
source: Operation successful!
vi: Thao tác thành công!

source: Term of service
vi: Điều khoản dịch vụ

source: Privacy policy
vi: Chính sách bảo mật

# termAndPrivacyMsg1
source: By logging in, you agree to our
vi: Bằng cách đăng nhập, bạn đã đồng ý với

# termAndPrivacyMsg2
source: . Learn how we use your data in our
vi: của chúng tôi. Tìm hiểu cách chúng tôi sử dụng dữ liệu của bạn trong

# deleteTipsConfirmTitle
source: Are you sure you want to delete this tip?
vi: Bạn có chắc chắn muốn xóa tips này không?

# actionFailed
source: Could not complete the action. Please try again.
vi: Đã sảy ra lỗi, vui lòng thử lại.
